Tekla Open API Reference for Tekla Structures 2025
DistanceList Properties
The DistanceList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of items in the list.
IsReadOnly
 Gets a boolean value indicating whether the collection is read-only.
Item
 Gets or sets the item at the specified index.
Top
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace